#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаНачала = НачалоКвартала(НачалоКвартала(ТекущаяДатаСеанса())-1);
	ДатаОкончания = КонецКвартала(ДатаНачала);
	
	ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ОплатаПоставщику;
	НазначениеПлатежа = "Оплата по счету
	| Сумма 1200-00
	| в т.ч. НДС 100";
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьОбучение(Команда)
	
	ОтветСервера = ВыполнитьОбучениеНаСервере(ДатаНачала, ДатаОкончания)
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьМодель(Команда)
	
	ОтветСервера = ПроверитьМодельНаСервере(Строка(ВидОперации), НазначениеПлатежа)
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Обучение

&НаСервереБезКонтекста
Функция ВыполнитьОбучениеНаСервере(ДатаНачала, ДатаОкончания)
	
	Результат = ВыбратьОбучающийРезультат(ДатаНачала, ДатаОкончания);
	
	ИмяФайла = ПолучитьИмяВременногоФайла("xlsx");
	
	ВыгрузитьРезультатВXLSX(Результат, ИмяФайла);
	
	ИмяМодели = "model_slp";
	АдресСервиса = "http://127.0.0.1:5000";
	ПутьСервиса = "/train";
	ОтветСтрока = ОбучитьМодельНаСервисе(ИмяФайла, АдресСервиса + ПутьСервиса, ИмяМодели);
	
	УдалитьФайлы(ИмяФайла);
	
	Возврат ОтветСтрока;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ВыгрузитьРезультатВXLSX(Результат, ИмяВременногоФайла);
	
	ТабДокумент = Новый ТабличныйДокумент;
	НомерСтроки = 1;
	
	НомерКолонки = 1;
	Для Каждого Колонка Из Результат.Колонки Цикл
		Область = ТабДокумент.Область(НомерСтроки, НомерКолонки, НомерСтроки, НомерКолонки);
		Область.Текст = Колонка.Имя;
		НомерКолонки = НомерКолонки + 1;
	КонецЦикла;
	НомерСтроки = НомерСтроки + 1;
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НомерКолонки = 1;
		Для Каждого Колонка Из Результат.Колонки Цикл
			Область = ТабДокумент.Область(НомерСтроки, НомерКолонки, НомерСтроки, НомерКолонки);
			Область.Текст = Строка(Выборка[Колонка.Имя]);
			НомерКолонки = НомерКолонки + 1;
		КонецЦикла;
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
	ТабДокумент.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.XLSX);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВыбратьОбучающийРезультат(ДатаНачала, ДатаОкончания);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТабРеквизиты.ВидОперации КАК ВидОперации,
	|	ТабРеквизиты.НазначениеПлатежа КАК НазначениеПлатежа,
	|	ТабРеквизиты.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств
	|ИЗ
	|	Документ.ПоступлениеНаРасчетныйСчет КАК ТабРеквизиты
	|ГДЕ
	|	ТабРеквизиты.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТабРеквизиты.ВидОперации,
	|	ТабРеквизиты.НазначениеПлатежа,
	|	ТабРеквизиты.СтатьяДвиженияДенежныхСредств
	|ИЗ
	|	Документ.СписаниеСРасчетногоСчета КАК ТабРеквизиты
	|ГДЕ
	|	ТабРеквизиты.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
	
	Возврат Запрос.Выполнить();
	
КонецФункции

&НаСервереБезКонтекста
Функция ОбучитьМодельНаСервисе(ИмяФайла, ПутьСервиса, ИмяМодели)
	
	ФайлДляПост = НовыйФайлДляПост();
	ФайлДляПост.Имя = "file";
	ФайлДляПост.Данные = Новый ДвоичныеДанные(ИмяФайла);
	ФайлДляПост.ИмяФайла = ИмяФайла;
	
	ПараметрыПост = НовыеПараметрыПостФайлыИФорма();
	ПараметрыПост.Файлы.Добавить(ФайлДляПост);
	ПараметрыПост.Данные.Вставить("model_id", ИмяМодели);
	
	ОтветСервера = КоннекторHTTP.Post(ПутьСервиса, Неопределено, ПараметрыПост);
	
	ОтветСтрока = Строка(ОтветСервера.КодСостояния) + ":" + Символы.ПС
		+ КоннекторHTTP.КакТекст(ОтветСервера);
	
	Возврат ОтветСтрока;
	
КонецФункции

#Область КонструктуорыОбучения

&НаСервереБезКонтекста
Функция НовыйФайлДляПост()
	
	ФайлДляПост = Новый Структура();
	ФайлДляПост.Вставить("Имя", "");
	ФайлДляПост.Вставить("Данные", Неопределено);
	ФайлДляПост.Вставить("ИмяФайла", "");
	
	Возврат ФайлДляПост;
	
КонецФункции

&НаСервереБезКонтекста
Функция НовыеПараметрыПостФайлыИФорма()
	
	ПараметрыПост = Новый Структура();
	ПараметрыПост.Вставить("Файлы", Новый Массив);
	ПараметрыПост.Вставить("Данные", Новый Структура);
	
	Возврат ПараметрыПост;
	
КонецФункции

#КонецОбласти

#КонецОбласти

&НаСервереБезКонтекста
Функция ПроверитьМодельНаСервере(ВидОперации, НазначениеПлатежа)

	ИмяМодели = "model_slp";
	АдресСервиса = "http://127.0.0.1:5000";
	ПутьСервиса = "/predict";
	ОтветСтрока = ПроверитьМодельНаСервисе(ВидОперации, НазначениеПлатежа, АдресСервиса + ПутьСервиса, ИмяМодели);
	
	Возврат ОтветСтрока;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПроверитьМодельНаСервисе(ВидОперации, НазначениеПлатежа, ПутьСервиса, ИмяМодели)

	ПараметрыПост = НовыеПараметрыПостФайлыИФорма();
	ПараметрыПост.Данные.Вставить("model_id", ИмяМодели);
	ПараметрыПост.Данные.Вставить("operation", ВидОперации);
	ПараметрыПост.Данные.Вставить("text", НазначениеПлатежа);
	
	ОтветСервера = КоннекторHTTP.Post(ПутьСервиса, Неопределено, ПараметрыПост);
	
	ОтветСтрока = Строка(ОтветСервера.КодСостояния) + ":" + Символы.ПС;
	
	Если ОтветСервера.КодСостояния = 200 Тогда
		Джейсон = КоннекторHTTP.КакJson(ОтветСервера);
		ОтветСтрока = ОтветСтрока
			+ "JSON: article = " + Джейсон["article"];
	Иначе
		ОтветСтрока = ОтветСтрока
			+ КоннекторHTTP.КакТекст(ОтветСервера);
	КонецЕсли;
	
	Возврат ОтветСтрока;
	
КонецФункции

#КонецОбласти
